[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
2967
6758
339
2021
1854
3731
4109
3792
4149
1519
2058
3912
2465
2410
1219
6654
7539
264
2456
4811
1292
2109
6905
5520
7058
6045
3634
6591
3530
6508
7044
3659
2073
3750
6831
2614
3370
4269
486
5770
4125
5445
2466
3743
3630
1726
2313
5906
826
4516
657
900
1871
1757
1939
648
2828
4704
7039
3706
965
2490
7399
2145
2407
7451
3775
6017
5998
1641
299
2621
7029
3056
6333
433
1667
1099
2289
5780
220
1279
7426
6631
3099
2205
7305
2620
5977
3329
1793
6666
2042
3193
2446
5399
4124
248
2252
5649
2212
4939
7239
3310
4525
2400
4921
265
1397
4699
1699
669
6407
1271
4741
4659
3870
4030
4167
5338
25
3466
6909
4417
1859
1465
7194
3938
1571
848
6986
827
2124
1991
7444
7037
2729
908
6308
1889
6810
4190
591
5598
5410
517
4128
1679
4853
6902
6122
1903
1736
3915
2602
6822
6630
4265
729
4448
1401
5881
6182
2646
652
340
7328
1320
1460
619
5505
2376
3272
3362
2810
803
1985
19
1635
7377
7509
1375
5393
5589
5037
2115
4707
5310
6811
6093
3263
5971
4148
4780
796
6038
4231
1722
6485
1920
1767
5915
6518
5648
4280
7326
6242
5328
1214
5741
913
5950
3800
1538
686
6734
1324
5814
4998
5176
535
307
4068
2121
7420
3255
7123
4305
3231
4822
473
5330
5530
1394
7495
4469
7467
5693
3618
5264
1734
316
3484
6043
1031
761
5370
3782
2210
1363
6301
3508
1907
5718
541
3038
6641
512
5243
2112
2891
1211
7257
7159
5816
4202
5864
3414
7327
7256
2935
4936
2151
4599
3227
3859
4691
2029
1344
7403
543
980
3605
5028
1866
3578
1335
6560
1913
6656
5689
4411
4750
3000
2975
1141
7148
2570
1877
5470
641
4333
5659
2770
2047
7532
606
6980
1750
7245
5839
4321
5788
6405
2107
1592
5461
3324
4052
742
6887
4819
3223
2717
5612
5948
2541
4409
3772
6012
1833
5560
4173
6662
414
6575
4407
1241
600
6637
569
5610
6917
7010
3397
5708
1702
4646
2663
885
5491
5011
2662
6065
2688
6678
4842
4801
3154
544
62
5602
6759
4464
1815
5698
2364
5938
5168
3770
368
7117
2131
2192
6015
3864
5681
3771
3166
5736
5537
5526
495
6386
1362
1829
2304
5619
6227
6515
4893
5957
5949
5081
2918
5051
5192
1745
5278
5651
7440
1656
3300
5778
6235
910
1613
2255
6352
4802
1452
3137
26
6663
2986
1746
3002
4603
3220
1567
1407
4403
2540
2329
3762
6713
3247
7543
656
1289
5769
2556
5472
6453
4350
7469
816
4914
418
5542
1386
3686
2741
6733
2515
4796
314
3007
1769
2415
5810
5928
1308
4480
6770
6469
1647
6293
450
4558
2693
216
4655
7255
6395
2422
350
1057
5482
45
1158
5105
6919
4462
53
7045
6050
2402
192
5677
5041
478
868
3765
4628
1924
23
5787
5139
4758
1154
3945
6928
6875
2522
1816
6929
1060
5858
5695
289
1737
7059
4969
4440
6104
5510
1277
4063
3700
5106
3481
7147
5153
5397
2842
3257
4985
7346
5074
3747
1777
2226
7354
6088
290
6350
1580
134
1245
3952
2049
5620
6569
2233
1260
3189
2667
7349
141
5430
1514
5658
4106
6768
3167
2282
69
1587
6046
2549
4909
7421
5525
722
7219
5501
4547
659
5605
893
3472
4643
7381
2827
1564
4036
5999
138
6722
5511
7523
4498
5801
4211
7477
4203
4490
4351
4261
2434
133
6543
4559
383
4040
751
5099
1205
2595
2221
4718
5296
752
2862
4458
137
920
465
6600
1036
4430
3049
5604
3545
3695
3691
1698
2791
926
3088
1999
6714
5822
4392
3342
4232
4967
6651
1252
1078
642
7025
1325
5889
6962
4386
5273
2505
5380
2331
2274
2612
5594
144
4677
6940
7212
607
7125
1805
4650
6325
3226
3966
4097
4329
6521
2230
7366
4298
5640
7370
1952
6583
4080
5791
3107
531
7492
1629
7055
6846
805
794
2732
5165
4510
978
5151
3196
6833
6966
4053
5984
2749
2461
7313
4866
4287
1395
2396
4289
1906
6040
5955
5450
3103
1283
2489
5566
1247
5538
5917
2495
1267
2435
1168
3725
4046
445
57
948
211
3956
5492
7006
6983
6781
7394
296
3764
2899
922
3651
2923
5728
6798
4291
6037
1951
1070
2265
3433
5678
2983
355
2799
7154
872
4355
7373
5292
6644
3203
5617
6417
212
3500
1744
5581
1582
2592
734
3780
7033
6567
3949
203
88
3117
5702
4220
3495
408
4214
571
5929
6740
5920
7047
4981
7507
5886
4130
3568
6587
1264
3613
671
5282
3506
5850
3819
7311
1080
5019
1103
1936
4744
3585
2211
536
1715
58
4413
932
1914
974
5333
6996
6551
2795
3062
2023
1970
4636
902
2444
7465
2218
3212
5623
7078
1215
6977
3971
3070
2334
5026
3860
1963
5284
4450
3961
5793
2127
5056
3606
7251
5823
5177
2267
4653
5775
4505
3943
979
1885
2491
6981
4105
3233
6507
790
116
5883
502
64
6193
1379
5269
2354
4183
6549
532
4993
304
3155
3418
1855
623
2483
6609
4486
4626
1610
4482
955
578
3469
5005
1695
3440
5536
281
810
343
3809
1066
3646
3055
4876
1043
3994
7393
7378
2674
4180
4301
5776
3694
2119
4216
3285
6314
4553
462
4399
6101
1633
5057
13
7330
1351
1779
7261
7408
7157
6286
4166
4442
5909
7361
2768
5274
4582
1697
1457
5396
1323
4778
2586
3987
1129
6725
1006
6542
1844
2786
5271
1018
847
3560
219
150
5122
1899
6003
869
4958
628
993
3317
6389
1302
2936
4380
2348
6250
1388
4986
7186
3456
6881
2990
4542
2380
2847
1146
5385
3661
6444
3106
1132
2147
2136
5205
100
7520
6751
1605
5190
1176
2626
5235
1220
6832
3128
5660
3327
1693
2848
580
3034
2857
6163
6107
2421
930
180
2477
4731
6501
6640
7111
6267
5298
7191
43
6681
945
94
2727
2087
5402
4760
2506
3080
7449
1946
1295
2683
4017
2022
5547
1916
736
4583
7137
5486
3740
5389
4928
6393
3643
1588
4223
6790
1258
3283
3586
4902
6289
2154
7127
1731
6284
7091
1684
5226
4089
4412
2970
3396
2648
7207
3845
6160
5308
4270
3523
4139
341
3242
4499
3627
3766
6973
4612
6220
4576
4933
2647
3335
2685
1227
2538
4151
3374
3893
2378
4568
3366
2539
1569
3209
6357
1152
2610
6176
843
550
3129
764
1960
5860
4941
3479
6968
6899
5474
6596
2439
5095
2508
7309
3745
4262
852
760
1348
1334
7160
3090
3811
6087
6355
4114
3067
4326
6248
5178
1814
6004
5179
4181
4924
2328
4293
2597
3068
426
452
3438
4144
3018
2873
2367
3158
2974
2638
4302
2028
4562
5096
6892
4590
1061
4369
4396
485
4117
5724
1934
2471
3529
5882
4374
5063
3641
1116
6078
5166
1511
743
938
5854
507
2708
886
3019
5918
405
3130
4641
7486
7363
6930
1688
3654
29
1474
7541
7387
2716
5416
440
3309
3703
4031
6143
4917
2730
5803
3515
1623
5436
4237
7528
903
5899
4021
151
293
4120
318
1121
3744
5003
4504
470
5744
3644
5217
4233
6729
2762
3937
4751
2555
197
983
4630
2448
750
4118
4372
349
740
6254
2196
4078
6206
6063
7371
7169
2776
3531
2316
1973
2004
1735
415
3824
2076
6535
2835
5964
330
2197
6283
6695
1294
6888
2499
3012
3724
6760
5562
2315
36
4971
1953
6835
6192
4145
5723
3461
3813
4544
2379
3886
420
7142
7122
5289
5305
7453
3595
6675
3901
2393
1327
4230
2484
6602
5694
127
4381
5963
2035
4531
6565
498
1706
442
2397
4163
225
3170
6149
5413
6375
2859
2702
2429
1842
6165
2169
3533
1778
5573
5705
5935
6985
4721
3289
5036
4543
3017
7008
936
2106
3976
6014
3598
5229
6890
4366
2838
1919
3477
3392
7206
6908
565
632
2399
3577
3407
6639
1255
986
7075
404
1965
443
5497
4340
3692
3620
1640
101
1014
5381
4976
7475
4205
2480
5926
1590
2604
1940
5988
5644
6992
247
6319
2851
631
1299
5936
3442
2642
419
1987
2356
3120
3501
4003
4587
4923
6390
7436
6689
5519
1730
670
5466
6482
5968
6920
5288
1515
4683
2351
5574
5647
6956
2910
7452
7447
3665
5247
7180
3955
5006
5297
998
1042
654
2728
245
3039
1402
1389
6497
7013
4961
3778
746
2189
3608
6588
2214
5663
18
5901
677
1419
7490
5203
2463
730
7395
768
425
4671
3270
1620
5335
4611
5184
244
3512
6441
2420
2056
781
79
4987
2998
3607
7458
3134
3032
5493
167
136
1536
7400
3364
2229
5251
5089
1550
6414
6272
499
5521
6861
239
5239
3818
6027
1508
232
5799
14
6886
3036
3030
584
7250
2099
4690
5391
1315
6178
960
4042
895
3104
16
5970
6094
4454
83
4709
2722
5498
3248
5442
4274
2699
957
3065
3373
4509
3172
6924
5208
566
3020
3132
7104
5017
6854
6834
6360
2893
4934
2519
5411
1976
7110
3051
7531
1270
2680
2558
3415
6111
394
1879
889
7023
5258
693
6324
2054
505
5117
4786
5746
6972
4719
3504
4560
6007
2279
710
1832
4680
3198
3528
2260
1110
1964
4275
6221
811
4315
1743
6894
5811
7344
5459
3168
2787
4766
1819
7335
1622
6447
6119
4094
6753
2120
6423
4627
2988
2273
5144
6487
2581
6424
182
5221
2453
5316
3066
54
1615
149
4567
3318
6223
3482
5426
6864
5368
6842
2437
6346
4858
4686
6318
1724
3868
6127
2524
7272
3650
4218
2695
3343
5202
3464
856
3855
3420
38
5395
1504
3294
2993
1616
4768
1008
6079
950
5625
6613
2070
5638
5555
5000
4831
5361
337
7042
1995
3689
354
7144
2867
2655
4732
634
4022
2511
78
3360
1248
5085
2167
2530
5688
6471
5504
2024
4779
4402
5480
6615
3873
4906
6625
5109
7513
4861
5683
1459
1405
7019
2582
3648
4536
3615
6552
1274
2756
1370
5869
3377
4679
4595
1148
4199
3182
1718
4728
1670
5322
366
5513
5532
4375
4429
5739
6720
4188
3729
2005
482
5367
6115
4614
2691
6976
1902
6398
1164
2596
1865
6738
1425
3443
560
431
1160
5422
832
4491
1206
5684
4461
5628
6799
763
6066
1390
663
3299
4065
3110
5129
2866
2931
4784
2832
5467
2098
1306
3899
1314
3159
2080
873
2576
5169
5064
4720
4002
1827
2248
2487
4695
2425
7015
7417
6898
7032
1727
157
4829
6965
496
2769
3015
2734
3436
3266
6862
7077
2528
7533
6674
2987
1846
1972
1890
5686
2007
7329
1170
4018
854
5234
3850
1868
169
6404
4377
4555
1166
6158
4460
6500
3503
317
6011
7317
3312
5200
1782
583
84
859
3368
2181
3610
3563
3914
4354
5484
3267
159
292
6971
1480
7098
4285
518
3073
2656
7512
4775
7336
7423
2968
3720
5974
3054
1122
2525
489
1242
5111
7540
4122
7292
5033
2011
2785
4836
6256
2318
5960
2669
4693
128
56
7038
6621
6431
5228
3093
98
4150
5940
5004
6298
7238
2411
2984
2745
5277
660
2283
1352
5369
817
2105
5495
6236
4894
3354
5997
3336
3084
2738
1660
2713
1184
3489
5870
1100
1657
6362
5631
7375
894
6658
2818
6234
2504
1753
4506
5873
6994
1151
777
1055
2771
1618
5468
5194
2473
4851
3910
5986
7051
463
5621
554
5603
1076
2198
3147
5600
6959
3112
3988
6748
6287
5125
1171
1758
6764
1510
1500
4949
2594
1287
3784
1891
4157
5295
812
6252
3681
4743
2942
6265
4832
1690
5636
3793
3215
2321
699
5514
3148
456
4177
4473
2919
4245
7134
2369
3749
5762
1073
5214
7254
1361
6296
2938
4988
5931
7129
7479
4176
7234
1304
3151
1087
5872
1391
6338
4974
5423
3181
3517
853
1941
7360
5753
5614
788
7150
5374
6450
3897
7548
5673
3894
674
2976
881
2766
1002
2140
7192
4436
1081
4951
1266
6504
2924
176
3273
399
5922
2739
2438
5540
6562
3742
6167
384
1518
6133
4597
645
530
3021
5137
1107
6690
5082
2345
6047
4742
1725
4260
4006
7310
1022
4624
592
4334
1839
3161
5847
2164
802
7265
4250
3097
3326
3795
1232
5340
3083
2307
6054
6243
5512
5160
6356
6337
1086
6574
7028
1853
5535
2814
3186
204
715
6141
4323
3603
297
3319
7203
1719
851
3111
3890
1606
778
2234
7525
5804
7156
4070
3297
6203
2914
5477
2458
2566
6682
6922
5690
5127
1028
1174
1858
1396
3905
4534
3554
7501
6174
4895
1956
6730
6420
3042
4837
6878
472
572
3576
5862
3383
2709
1775
4781
651
5517
1931
672
6702
5941
4927
7294
4378
1023
6055
1892
7197
177
6906
3287
4153
6914
4715
7121
4662
2247
4835
5156
2999
3400
6857
1870
1112
1250
7546
5052
4276
4191
2138
7445
6142
4648
2603
4874
7214
3349
2030
3192
3746
4313
2350
1109
6830
1200
6780
338
119
1818
4873
7496
7515
7491
1050
515
1579
266
2358
3521
4431
6139
5792
6474
6522
226
2130
6754
7380
7295
7362
1545
5371
4512
5315
5254
523
637
3271
7419
5347
3705
3351
4007
891
1268
6311
3717
3096
7404
6694
3951
2572
6819
2879
6327
4082
4225
3328
4337
753
1516
6632
2561
1565
732
3732
6396
5933
2170
1038
5076
6750
7016
4623
1243
5821
4989
6680
6788
7213
3359
667
5133
7448
413
5634
2423
5149
2775
2172
688
5824
2363
1068
5785
1532
382
2243
5136
2370
5731
6366
4038
3783
469
4478
4912
5438
1760
2046
5829
1631
4930
4152
4119
879
2091
3878
5773
7152
6829
6493
2841
3157
5529
4841
2032
6671
7498
1126
6511
1471
7542
5118
3990
2209
3290
1958
4090
6164
3474
5287
4675
3113
3345
1812
5475
60
6427
4996
1901
4061
4324
7483
4872
3430
2394
4123
6683
3040
3308
5518
1411
3836
2064
7225
6870
7196
1556
1599
1780
156
4723
1905
5488
3053
6704
2682
4108
6189
4155
2069
6796
1835
4267
2017
5572
844
6326
4663
1900
3152
6989
285
5121
6472
2568
6057
2502
970
4929
3977
5876
2068
2820
7000
1981
6016
7069
5502
4310
3679
1732
6217
240
227
5613
6889
6946
5979
2391
81
1938
3941
2901
2012
7544
5656
3213
1127
2639
3108
5047
2406
5087
951
4745
5206
1966
1542
7545
2897
1783
6467
5709
5406
5777
7164
3246
3004
3095
2190
3121
2019
5034
2431
5050
3238
6633
519
7510
2567
5494
6369
4353
5711
5088
2563
378
17
4975
7224
7062
1010
4592
6490
2512
5624
6303
7046
5591
6151
234
2223
4500
1915
3455
3998
3626
252
3173
3580
3923
4757
5344
208
1792
1917
5383
1840
4439
770
6749
3934
1638
194
4848
943
7096
6108
7299
4584
1235
6557
4970
2401
2275
5293
6307
5691
2330
5134
1509
7493
1478
1604
5281
3207
3385
2067
4335
2474
5242
4249
4937
7410
1721
107
3451
3144
782
1341
7088
3982
4077
1950
457
1191
5317
3844
2060
7012
3483
4995
1883
5379
2673
733
6949
6812
4700
6058
1424
6391
2055
6538
4356
3444
158
1453
2374
6445
3986
5861
5215
4748
2514
6855
4578
5233
4514
1195
2972
112
1045
1090
4736
4234
3243
3190
253
1595
1399
4005
6897
6059
1307
3127
6947
3562
2863
6852
6664
3044
758
1373
6916
7188
4712
7223
1603
2290
7131
6238
6649
2908
347
610
459
6510
6295
2521
5715
2526
1343
5420
5868
2772
7183
5311
6825
1111
1787
7332
3978
332
3871
4034
7422
1398
2632
1888
757
3320
5714
4782
7459
5956
5884
6815
7175
7241
679
2337
611
2178
6800
6818
2185
4777
3253
3219
5894
361
2156
5533
6817
5606
3150
6229
6083
6874
2231
4278
2428
6262
3848
1065
1350
2327
4983
4169
8
5552
3046
5107
2721
7527
5902
676
7106
3617
312
3079
6134
300
3544
1749
711
327
3662
6144
6582
7001
1196
697
5213
449
4814
3727
1671
850
6570
557
3718
956
3716
6762
6635
830
1502
6175
1678
7391
646
564
3781
7086
6610
6868
4968
6491
6479
513
5716
6802
3206
6529
7341
6084
2876
3918
3960
3924
115
6882
7383
2272
1367
7300
1440
6430
165
5189
1449
1977
7124
3842
7097
6364
6387
4767
2874
2898
1431
5969
2564
6895
4776
5959
1733
4762
3058
7499
3262
218
6845
5687
2644
2965
791
2562
152
6064
2472
5092
181
4476
5805
4304
5796
5668
6067
5142
6380
1838
5348
250
6840
5360
4908
5578
238
4444
411
277
3023
3177
1072
5641
1959
612
3059
3153
1089
1492
4870
4408
4539
4497
4194
1297
2710
3999
397
4545
5954
1572
3052
3228
6091
5496
7050
5341
558
6512
4363
5952
4258
4479
4960
4878
4871
5834
7529
6135
228
6893
1910
1326
3829
7333
6636
5635
5398
7163
4475
7339
3917
230
4922
6402
5632
3925
5874
3711
4657
187
7353
5903
3325
3225
2985
1435
2008
577
3657
3487
6347
1189
3825
2479
6718
429
254
5123
5182
373
3416
1544
1423
3631
5186
2529
3005
2335
1978
6197
2714
1986
400
1339
533
3268
3758
7222
7350
4652
4556
3447
6020
698
3851
939
7017
403
5892
6233
6804
3668
1619
5607
6571
3126
500
2346
7519
4575
6161
1669
4466
2945
2811
2079
2761
7462
2266
1364
6032
2202
1251
5237
185
5697
739
326
7067
7036
2496
6611
6757
1128
1849
3141
2188
6304
967
4015
561
7210
3929
907
5431
7103
2840
946
7208
5815
1092
4862
1645
5961
6847
5907
4081
1265
4257
878
4794
4066
268
7414
367
372
3344
4729
2220
4357
4887
4651
7514
5042
6900
4846
2831
490
2812
2341
6517
2310
3536
4911
5887
2139
1347
2979
7168
529
1497
4059
2174
6477
789
4012
4790
4956
7084
3280
3856
6166
3146
5951
4640
4658
6807
483
2531
3313
5937
1696
7031
5306
315
4722
195
6000
581
6257
6513
901
5732
806
5071
1273
1291
3921
6171
125
2523
5255
320
5382
1365
644
7464
2366
1639
5595
5469
5972
5900
4405
2249
1791
1328
5819
1278
5650
4806
4515
4423
3622
3542
2852
3323
4182
5212
962
1609
377
4175
1529
2686
5001
6660
4793
3946
3425
6199
6195
1811
6191
7061
438
5674
981
6181
6821
1755
4761
1199
5618
430
6036
838
1083
1843
6454
7190
6941
1540
5162
1173
1360
927
6769
2796
2299
1700
5719
3805
964
171
590
1178
1764
3957
4889
4358
3614
4834
6194
162
2144
3304
2616
5720
61
2640
2510
4864
2705
5575
785
5120
2778
604
3967
5286
5596
1741
1044
7505
2293
7534
447
1165
1400
3457
5352
6128
2937
3907
3807
2740
2236
6473
5417
2804
3125
5429
198
5424
745
3565
988
3391
5257
7454
6109
2044
3763
3690
6553
2724
510
3232
2911
2995
2631
2925
455
3983
3200
5020
1880
1124
4852
1566
3428
4763
4314
1221
7537
5261
4717
3821
1140
5797
5392
5779
3435
4390
958
5059
7181
35
4788
1598
4299
2182
2447
2470
7411
7536
5806
1071
358
3558
1822
3403
5481
7074
7368
2964
2513
5487
3258
2615
1651
3696
888
4035
6998
700
3969
3693
959
5433
6002
2689
1272
6974
2288
3131
5054
260
5506
22
2359
6377
1332
2237
2904
1428
4168
6528
2000
2419
1728
4982
4799
5114
6099
940
52
3459
4004
6809
5579
3649
5752
7282
2078
4856
1751
2947
2227
2
7226
1208
241
728
713
562
7406
323
1040
5942
2707
3507
3494
4266
4239
5405
3216
6345
4940
4596
246
4557
2102
6335
3592
2765
7312
4942
24
6126
5210
4342
2652
123
6506
2591
5079
3677
5637
178
5835
6429
1676
823
5990
6211
2096
1573
4254
1547
5010
579
2930
7442
6085
5592
2992
3375
301
7109
2665
4273
7216
804
468
7424
6226
6408
2382
3184
5193
214
4437
3647
3371
1182
283
6316
4973
1527
99
2875
2672
5223
1230
7289
6074
4092
1096
7043
416
3779
2100
5174
6765
4410
3682
3254
2953
2917
4252
2690
4979
5580
6533
3653
5113
6237
2257
2939
4606
6279
4660
4083
2956
3827
1013
539
2278
6937
1594
40
6436
3086
694
7093
3047
3522
1802
720
4055
233
67
4676
5485
1856
864
1662
1142
2132
196
1034
5507
7470
6475
4048
1691
6110
4206
3411
3814
4255
1256
5093
2535
1384
5921
4574
4565
1309
6697
503
1410
5758
793
3057
1694
145
3
4420
602
1275
6232
994
6805
4774
3194
2485
3698
1212
5865
5312
3553
7441
887
2457
605
1482
2045
5152
1188
3664
755
2559
3869
2653
555
6198
2894
1762
574
5890
4093
1630
2141
6240
1417
6988
7478
1961
6031
975
5471
370
5147
2634
6418
1648
476
3251
5680
102
2902
6848
4843
1685
3338
3493
7248
5353
122
6838
295
6785
1047
1067
2033
2455
1794
6147
3485
1522
4174
731
5895
2950
3549
4
6784
421
741
6752
7273
553
3535
6162
1796
4085
4235
3964
2571
7139
3854
5207
2955
3406
691
7141
762
2809
4607
774
5798
1928
6400
3286
2031
5738
3518
2103
2026
2781
6096
4991
4681
2240
1627
6156
1409
5978
6130
4773
2027
3940
7285
2478
104
6
4549
4963
1882
6439
1093
3265
2239
2250
5571
7005
7535
2057
6292
5561
6483
6481
3965
4295
5939
5856
453
2389
1485
1909
5995
2110
6056
4992
6328
6460
7100
3140
6225
1357
7301
336
3087
4229
4103
570
5672
3468
2111
1593
2163
1716
324
3801
2339
417
7094
1674
5362
7342
89
7303
7202
7243
5761
3847
3567
1366
1406
5073
573
1030
5366
3538
6266
1056
912
4771
2179
5840
4950
2118
1990
1455
3587
714
1801
3499
3217
3625
6041
4896
7116
2966
76
3992
5039
2973
4548
2958
193
1873
6185
1943
5549
3601
4096
622
5456
5
7389
4279
727
6212
2583
5692
4288
1851
6264
1033
684
7446
2527
6348
6140
6268
6539
6275
1763
395
7187
2048
7258
1082
2943
4382
4897
724
6618
3011
5751
6455
2636
3340
1444
2929
3115
1535
3426
5546
4880
5376
3788
4493
5259
7236
5993
643
2575
1826
540
2503
4638
2601
3721
5548
1433
2940
7118
841
5040
2817
5400
2552
7227
896
6622
1416
4826
5664
6700
282
545
1175
72
4359
2834
1180
7494
4875
1893
5567
2149
2395
4716
6679
1005
1666
4481
7162
2892
4817
4494
4642
563
4610
2915
3022
682
5372
6329
4903
2679
2155
6379
4300
779
1179
1848
3759
5545
1441
6259
1486
1984
6035
5703
780
4025
4696
2232
749
4615
2659
3936
4240
2426
4667
2168
6696
707
2468
5325
944
5981
4185
6116
4689
3984
7115
4899
7306
3541
6023
6782
3419
2927
222
681
3346
673
5154
5115
267
235
5947
1475
106
3277
360
4419
3537
4668
3680
1234
797
3900
835
528
4416
4746
1161
3776
6152
2294
795
3078
5094
2037
6244
6486
647
708
7
709
1102
4572
2166
6406
4172
7176
3583
2869
7275
5476
110
3866
1383
375
31
4639
7119
2469
968
6849
7522
6358
5932
4649
6462
2297
4824
3081
302
704
2413
3804
4521
2946
3045
1163
2752
5836
5813
5067
5992
5102
5831
2952
3974
168
2285
7185
147
2254
2905
963
59
1186
4759
3728
5754
3756
7291
2228
949
2083
692
7288
261
7149
6461
2117
2676
2798
1105
4395
385
201
3833
5772
3570
5097
7277
6385
1878
5246
3048
3109
6932
4789
3903
6918
386
4821
3014
504
1894
3612
4164
428
3412
1575
4850
243
5256
2113
3754
2864
2598
4918
6213
3519
5018
2194
7179
6957
5418
1948
3669
875
3075
6334
7365
2162
1563
6843
3449
6584
5685
6113
4451
6214
7215
5825
5404
5696
6563
7170
1636
174
3710
3959
4050
4916
1285
5556
7318
6435
5452
3794
1358
2507
82
4797
4739
1157
4702
2408
1020
706
1001
815
1654
7022
1713
7177
6593
6667
143
3670
3557
2006
3547
3708
589
1614
217
4215
4297
3390
3314
5727
6931
7189
5262
4362
4383
2606
5563
5885
1923
5733
2268
1236
3249
4263
6850
6684
3667
5008
5722
6545
5451
2994
257
1204
207
2607
5679
2692
621
5851
5735
4522
6594
1451
6858
6370
3348
3683
2253
858
3063
3797
4360
2949
3962
3520
2856
4849
5608
7538
6062
3973
501
209
2123
3006
3947
1525
1908
2404
2336
1686
2129
346
303
2706
6904
2854
3714
3963
5774
4178
2822
2089
2409
4898
1313
4159
3408
95
3767
1353
2849
4062
4110
3676
1754
93
3723
3812
5601
1378
479
4467
6839
1368
2459
3808
1037
7034
2944
5191
1643
1752
4014
5201
678
3138
3889
1414
6771
6691
3751
4133
5527
7230
6921
7060
525
2611
4311
2412
3363
6353
5848
4477
5280
1461
5171
2718
6601
5183
3931
3496
7461
3439
620
164
1861
5195
5155
1650
6646
4580
7220
5128
2703
3379
6153
7345
2053
6775
1543
286
6756
4882
1831
2789
6828
6958
4060
2547
6866
1506
2126
288
725
2418
5622
4618
653
7120
1979
4825
205
1962
3003
1781
3165
4309
3282
7174
5314
4242
2206
7432
2180
1190
1225
3628
7297
3588
911
2800
2381
2039
6309
5086
3611
2758
3655
6954
4954
630
4879
6323
1432
6608
2175
329
1466
6727
2657
3139
4730
863
3275
1012
6499
5022
3376
3306
916
6313
839
2065
6960
5478
432
1608
1682
6440
1570
3234
1864
1637
2284
5818
3178
402
2697
3550
1761
776
7526
251
3156
6766
3933
7409
1203
1298
999
1491
2855
4492
5967
1224
783
4517
1213
929
6883
3785
1817
5919
3673
7228
7171
6534
3136
4027
435
4809
4433
6661
1498
3596
3013
798
1084
2805
4328
754
4735
2885
6939
6776
1201
6716
1874
1436
996
2625
2989
2951
3602
1442
2565
359
1642
6793
6184
3303
4189
7040
7130
6492
1867
3769
1041
668
1296
4348
4171
3008
7508
1823
4990
2183
582
3671
7516
1661
2377
2440
4604
2629
5013
799
5652
5924
3733
6877
7138
5219
3722
4513
4243
3876
3591
2160
2753
5962
5407
5465
5807
2996
5016
4000
7252
1810
5808
42
5781
4966
4156
5138
6249
7184
407
5944
3526
175
1000
3208
3975
6001
7473
4635
7237
4165
4428
6556
2187
5783
1004
1533
5817
3991
2038
3462
7048
5443
6209
3492
1974
3911
2569
3160
4935
3315
1456
3311
4198
6013
6033
3534
2701
6531
3604
7281
6131
4051
4854
6188
1481
6124
2476
6294
1496
1742
6576
506
103
3264
6590
70
3445
6755
3372
4798
6896
4865
6277
1458
6392
6744
117
3188
6200
2492
2432
4221
3551
7488
6787
1912
1576
5657
5249
3010
3486
2025
1828
7133
6480
3906
6912
3142
3183
721
4737
434
6470
4502
4674
559
4179
2843
4938
2493
4421
2258
568
3735
6616
4074
1254
4944
7418
5349
1967
4010
1503
4581
925
1664
1983
1847
2750
6634
5421
2326
1935
1095
6239
255
4016
5669
75
2850
1489
2635
5415
675
3572
3707
1053
6520
1046
5444
4957
2195
1293
6686
7405
6786
2712
3427
1634
586
118
613
6219
953
124
2963
3882
2922
1336
3863
6026
551
6999
5053
2823
6443
1172
2291
837
1601
1149
2003
2486
773
3331
1887
5175
4142
6580
1921
1549
2537
6544
952
6488
6761
4733
1413
1321
5197
2819
4079
5355
1862
5409
4749
933
509
2754
213
365
7334
5108
6383
2550
2664
6624
1993
6746
131
369
4456
3935
3688
2871
424
7101
1337
5855
1162
5319
4884
3204
3666
5994
4997
4885
5035
6090
6476
1079
3505
2355
6409
7262
1596
5090
7209
7286
7076
5991
6851
3697
398
2613
6103
1290
189
48
2806
4907
4361
599
941
1108
5551
4401
6712
5987
934
6628
7146
4196
5544
1387
1689
7081
298
3954
6155
6595
4343
7364
2219
357
4984
4364
231
4507
1954
1658
1130
6984
451
4529
7182
5337
6659
5457
2043
461
2224
615
2449
2836
5077
5032
2460
685
1860
3417
3660
1720
695
7304
121
20
1445
4026
4452
1852
2320
3757
4449
6247
242
5898
6190
4397
5199
2982
5276
4962
976
2816
3922
2259
3025
2016
6677
918
2623
3571
2668
4999
3393
3394
2794
5786
7244
6208
2978
4008
4585
5270
2546
1377
7517
1546
7315
821
50
1710
5713
1809
6502
474
1703
2292
190
4033
6121
188
1404
1628
6371
2088
6049
6112
921
6022
3016
3803
2534
3332
2081
6685
6708
6867
4915
114
6231
855
4445
3334
2443
2780
2262
3561
6614
6365
3341
6030
4415
1768
4724
5500
2961
972
5845
191
4619
7014
4654
4694
1467
690
2957
6372
4312
1672
6100
2878
6907
617
3124
3071
6955
5304
1528
6081
1032
3802
2826
7114
6019
6705
831
6604
7200
6341
2352
4368
7066
34
5131
139
7412
4752
3218
2700
5299
6901
6299
7151
4158
4644
4830
6331
1097
4678
6204
6463
3316
3806
5853
3944
1240
3865
4844
319
1222
6255
2360
3843
575
1059
1578
4608
2755
3239
3237
5021
6741
6647
2281
6210
5388
4550
2241
5740
3736
3240
1799
6415
5534
1673
2036
4994
1568
1925
1426
5387
898
1177
6388
3566
4625
1209
1789
4453
587
1555
7416
1218
1185
6177
4131
2637
4422
5666
6150
6527
5615
4349
548
2731
1517
5725
3822
6791
2462
744
170
2830
4901
2417
5958
4943
6359
2347
4487
635
987
2014
4134
4341
4783
1216
4785
460
665
4919
4812
2737
6397
5350
1881
6042
3135
3061
321
1770
1147
4705
3450
1490
909
2735
3875
2609
202
696
6961
4138
6368
4045
6503
1009
1922
2773
917
813
640
393
4485
1501
5241
7413
3838
3413
2441
588
1075
4200
5742
4009
448
4102
5263
6381
5432
4088
1863
2063
2675
6561
2797
173
2398
5250
5965
1652
310
7530
6987
4137
74
2720
1257
6082
2497
15
1281
5062
4424
6568
7217
1625
7382
6154
1804
6496
7267
1632
1944
3490
6558
2482
6159
1159
5927
4905
6836
1244
1246
436
2802
2340
5867
1904
2980
3593
2641
7089
521
28
3857
1131
7080
32
2751
1434
6820
3624
3409
6216
4533
866
2912
1711
845
7274
5585
4327
6950
2520
390
786
3347
833
4338
6102
4527
1493
2608
6458
10
4904
3791
6105
7323
215
7049
7500
3453
4121
7063
2311
2860
5584
3543
7247
6879
3525
3072
7476
4633
3350
1857
4579
6572
3448
6564
4932
5103
4528
5852
6039
1559
6446
1495
3828
4489
862
2152
4389
3211
2733
6546
305
5265
5983
3573
5425
4107
1305
5238
2868
6129
146
5784
1342
3423
3968
4602
7201
1505
3381
5586
6726
2890
6523
1359
2430
3452
392
3926
3840
4186
6401
1898
5058
6872
961
4708
2150
1303
6990
748
6547
2390
7211
2921
6739
2649
2587
5342
5896
4041
966
2276
1319
3919
1707
1557
1541
3817
2599
1135
5541
3260
3858
7158
3288
344
6138
1677
7054
3748
6876
7390
6942
1421
5905
3958
2200
3581
2199
2694
294
3867
2670
3582
3388
4765
4286
4086
1581
6993
3908
4001
4926
4978
7064
5539
4011
6844
6806
4601
1830
65
2405
2332
6373
2368
882
4091
2774
594
6808
2464
2314
1507
2114
6880
4532
308
3753
3179
3105
1748
924
6300
477
7379
4815
492
6824
6351
1484
3001
1558
7502
1427
2146
5528
6075
6827
1683
4530
1088
3789
5080
609
1318
822
7356
97
389
3399
6721
2837
5996
1340
2261
7087
1872
6215
6434
4714
5646
2907
1007
5553
3470
2821
3834
2886
1422
5857
6422
4666
3930
5771
4888
1192
6028
5609
7302
3846
3589
5253
4621
3702
1714
6599
5309
3205
6451
2344
3321
1499
2577
51
1464
3786
5667
735
1118
3291
3369
6526
765
3849
2954
3645
7472
2928
5717
4344
5832
5279
3760
236
1845
6703
1443
3229
969
5294
2573
5893
6952
6330
5503
2128
2322
4827
6505
1450
7143
3734
4071
4306
5653
6269
3970
2895
4384
3637
800
5661
5343
4292
4352
3089
2906
5048
2627
5943
4098
7266
6577
1039
1187
4869
1155
1113
5587
1933
0
5642
6612
7007
2933
6024
905
4371
3761
4756
4629
5812
7068
3741
3879
4588
3454
7398
1537
5266
6653
256
4828
6411
4972
1646
2557
4948
6421
7369
4538
6514
6865
1837
5706
3041
973
4064
4913
5645
5373
6736
1930
1237
1886
5569
3995
3826
4569
2588
4552
4474
2361
1197
5225
4073
1074
4204
1975
3509
5301
2605
5524
3382
2333
4438
4347
6963
5434
2309
5820
3633
534
7140
7135
655
2793
4632
1382
4855
291
1996
345
4370
2204
5755
2225
4365
2319
4682
6495
108
5707
7004
142
3774
4457
7351
5675
5414
5643
27
6498
4069
5170
5946
6586
2451
6218
3082
7347
2481
6071
4573
4740
6969
410
5973
4687
1249
3024
7352
44
5830
6554
5365
4501
6516
846
2238
3367
4154
7041
1183
2678
7358
658
4980
597
601
2579
1253
4511
1469
3077
914
3035
471
4084
4868
4332
135
627
1795
5140
7056
3527
2880
6657
1597
5112
1403
3511
3642
5626
4920
3398
2034
4253
716
3546
5236
6276
2624
2887
6936
567
1551
3629
7030
5245
4111
6873
6426
262
374
5359
5313
6261
6251
1202
2372
2143
1663
237
4800
705
6222
661
5749
6097
3175
4385
5303
2171
5148
3895
1772
7260
3874
475
5044
6676
4049
4637
1988
6555
1115
5384
7235
5378
2215
2948
353
2590
5163
6048
4860
1310
5198
6970
6797
4318
1123
2158
5364
3353
5173
1554
4524
5794
271
6117
6336
4600
2536
2909
935
6456
7132
5318
4099
1269
6246
4591
4072
3118
7397
664
3029
1488
7343
6367
5015
1472
7268
4520
6826
5483
7307
388
5143
5002
6412
6789
7072
6278
3559
49
1740
890
5075
2532
3421
7242
90
3663
7482
5453
992
3296
2436
1346
7205
1420
5564
6494
4387
1261
2059
6711
1408
3098
576
1300
4713
3597
2040
3471
3091
6687
7107
5846
2424
7439
524
5878
2134
1836
2002
2176
3357
2618
5272
3584
5682
3656
6607
6519
7503
928
4019
717
1776
4195
5756
3556
4710
3927
3122
2962
2142
1600
4953
4129
4376
200
3269
2589
2263
7193
5024
2186
1487
371
5356
6550
1153
4807
86
4425
6442
7165
1439
4881
784
2050
2245
2373
11
3116
6814
6944
5757
6603
5427
2280
3480
4222
68
120
6801
6891
608
4634
7229
5891
5327
1712
6315
4427
3638
7487
2015
4839
7511
3378
4685
870
6652
1194
259
5187
6933
638
834
1322
2977
5244
3841
6464
718
6923
77
7024
5049
4290
6172
1584
322
206
441
1119
7348
6438
5844
1329
689
5795
6270
4706
3037
2585
4100
6592
4701
348
1989
423
3632
6717
860
4803
6098
7463
3799
160
2542
771
2452
769
5700
552
4488
6813
5577
6525
2744
3904
2725
2357
6935
6871
4964
5386
6524
311
7466
494
4857
6312
4320
3514
7276
4264
2553
6773
2085
4087
2882
7481
1098
1052
4813
6263
4394
467
6975
1876
7253
3386
6384
7438
3261
6403
3100
4101
2746
4426
66
2302
5230
5358
7246
5745
5523
5268
3985
6468
2433
6410
1786
5875
2251
4160
5146
376
4336
3712
5437
4393
7484
649
3877
4146
1167
6803
4818
4747
269
5031
5290
5222
5849
4551
484
33
595
2018
5670
7259
2981
4406
3726
1895
6910
3069
7372
9
2932
5760
3579
6743
7298
2122
5490
1530
4136
3060
4804
2711
792
5116
6044
6207
4605
876
1937
2872
6428
6540
5463
2651
1797
111
1330
2900
3942
3575
4227
3465
2384
7166
4398
6698
5172
4339
2013
6778
1644
787
4013
1808
6532
4414
2108
7433
1312
766
3619
2767
825
1229
3410
1049
1875
625
865
3773
5671
904
2742
5252
1125
4959
807
221
4141
2997
1430
5412
7549
7232
1354
598
5712
5458
2643
2051
4770
6859
1955
3050
6344
6230
1765
1446
6619
3701
2881
4965
4039
4772
6291
2298
6180
6437
3279
5768
1709
4734
2593
4523
1583
6742
4754
2305
3820
4823
4656
3180
1834
153
4056
2719
1773
5863
3085
1376
5730
3446
6623
1479
6205
3339
738
497
6076
2353
3950
480
6605
5759
4277
7018
4791
5710
4162
7388
616
2092
2960
2084
3119
6343
5676
7233
985
3174
6363
4838
5701
6339
6114
5976
488
2645
2386
5916
4890
3861
7376
2861
5323
41
7367
4247
3431
2137
5629
5729
6745
2554
5275
6672
2916
1945
1003
7279
6665
6642
7337
1611
7415
3199
3639
947
5599
5038
880
3684
6320
2338
618
3768
1824
5045
1349
39
5030
5110
3195
3123
3881
3365
3555
37
129
5734
801
2343
1617
7518
7271
537
4047
210
5232
1927
7284
5633
6021
867
7278
840
6068
984
2815
522
5354
3467
7287
650
2062
3384
7308
96
4140
2093
6548
1896
1136
6860
849
6853
3830
3102
1133
229
2159
5164
2383
7316
4840
4684
4631
2375
828
6186
6484
7172
1687
3302
819
3432
3675
7270
5180
4115
1226
1825
30
7092
3831
6927
2177
6589
71
6260
6774
5764
5390
1766
4112
3552
7145
3730
4571
6489
3913
4495
6863
6648
2628
2518
2009
5267
2488
2516
5329
7402
931
5565
5953
351
7407
2888
5654
1169
4331
5167
2101
4210
1788
1591
437
1282
1659
3475
7338
5911
5454
4058
4688
92
4251
5240
6282
626
3953
5248
3839
3293
273
2403
1393
3993
5879
5782
629
759
4319
2301
199
2066
4726
1675
2548
3621
3539
1692
526
6953
7429
109
1820
5747
6077
6620
1372
1798
1024
6183
5766
5196
5516
4201
6938
3473
5141
2148
6432
274
4388
6201
5809
5888
4345
3752
2600
1784
6465
2671
3928
4764
1701
1957
6086
7474
1138
4283
5161
6136
3171
1
3222
861
2467
1114
2001
6010
3853
5446
1369
6967
4067
5065
680
4054
335
3738
4244
6053
6670
6069
5568
2287
46
1392
6978
2077
3380
1035
1771
7178
3635
3389
6317
5934
7437
4883
55
2715
6945
5012
163
412
1708
4316
5904
6120
6951
6699
3145
3892
7431
5665
279
3033
1561
1094
4303
4563
6072
5069
3599
7331
362
7450
396
272
4113
5324
6709
1233
7319
5611
2677
1064
5060
3979
4246
4170
5841
6466
6302
21
2269
7002
4075
633
5307
4224
2969
6948
2388
5072
2544
4043
4947
1473
2387
2833
3358
3891
5630
3989
3672
6034
2264
4076
6241
2303
7249
4161
493
4616
2759
3463
508
2813
1418
4537
1841
6823
3191
6145
6061
1723
6449
6376
5394
814
6132
4900
6763
6170
6816
842
2213
3402
3798
5357
7321
6747
1911
1649
4044
3074
5930
224
511
5023
4613
6719
3197
5157
1288
4503
520
5597
636
5912
2041
1463
5508
5462
7430
6196
6148
1316
4284
2173
5419
63
6354
3405
1982
4863
7218
4540
130
5800
2362
4808
3244
1385
683
7263
624
4577
3640
4886
2654
5866
3026
5531
3687
4664
6394
2779
2896
5449
5014
1992
3281
3322
906
4208
3164
7020
6732
2574
4248
6095
3441
3600
7204
6006
5104
2630
2324
3230
1019
1156
2317
309
2082
4465
6179
5224
2696
1520
3437
4727
7320
4564
1800
7264
6169
3434
5320
4132
4024
1429
5763
7443
7386
179
4446
1238
2858
3031
1560
2414
3352
5737
5464
5158
1968
3163
1942
7280
3898
2617
6915
4187
1454
2157
363
4594
2165
5557
6728
1104
772
4593
4769
284
4670
6137
7003
6029
877
2747
2619
4472
1589
6566
1437
3564
7401
2845
3932
3574
3301
5126
4554
4977
2517
4192
3387
4535
2075
4945
3256
1091
3513
1655
4463
2095
1331
2116
1552
4212
1069
5985
1521
6413
542
2442
3880
2760
391
4711
1381
1106
1621
5260
2074
3027
2246
3810
6585
7290
2020
2807
275
6310
6425
3337
702
4672
6253
3699
47
6841
4127
7471
5828
7355
6767
4787
4810
1607
3996
6598
4400
3401
1665
549
356
2216
3498
4238
2684
3305
4296
3888
3460
5029
4379
6080
5570
6051
2325
7085
7052
4443
3333
5204
4570
7325
7009
5447
3187
3250
1790
1021
328
186
3678
6925
1574
5748
7269
1228
1259
5455
306
5550
1585
4028
1539
7521
1150
2135
5923
6645
3884
7456
3885
5216
2193
7460
7053
1534
1476
3356
331
2201
1738
5285
5509
1918
7113
3685
6979
5439
7136
6332
5283
6146
4645
161
1143
3872
666
2385
5078
7504
593
2277
6378
3909
2153
4147
1280
2533
5833
5027
2306
719
6273
3092
989
1477
3101
726
3497
7374
3259
3201
5135
1447
5982
2883
4325
2971
6997
4346
401
6416
7070
1969
4435
87
4432
6349
1134
2323
5132
4404
148
4228
454
1850
2660
4725
379
990
3224
3114
2086
6274
3292
5068
6943
808
1207
1624
5218
6926
4447
2681
223
2704
997
1971
3790
4518
5838
6399
5408
3491
444
2666
4367
4226
1054
7435
687
7322
3274
7384
5326
183
723
7090
2445
7195
4546
4322
6723
4820
5843
1026
446
3252
7314
4816
2295
991
5100
703
3210
2824
4669
4470
333
2959
775
3658
4795
6478
1333
2790
4673
7035
836
1438
6792
829
5061
4135
4256
6911
6280
1926
4271
2010
6794
155
1415
1015
7427
4468
7428
3133
6597
3245
4665